#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.vpc: Reading...
data.aws_iam_role.labrole: Reading...
aws_cognito_user_pool.mctech_cg: Refreshing state... [id=us-east-1_vkq68eel1]
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
aws_cognito_user_pool_client.mctech_cg_client: Refreshing state... [id=ka4l22a7d5ultf7k47giho0bv]
data.aws_vpc.vpc: Read complete after 0s [id=vpc-09087a8211f98da81]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-0d81ffd4d8316977e"]: Reading...
data.aws_subnet.subnet["subnet-00d780a2d518f5daf"]: Reading...
data.aws_subnet.subnet["subnet-06bc9c29259a1b8aa"]: Reading...
data.aws_subnet.subnet["subnet-0e3bd9720bd4238db"]: Reading...
data.aws_subnet.subnet["subnet-0d7a2d72cbad29100"]: Reading...
data.aws_subnet.subnet["subnet-07a84bddbd722791f"]: Reading...
data.aws_subnet.subnet["subnet-06bc9c29259a1b8aa"]: Read complete after 1s [id=subnet-06bc9c29259a1b8aa]
data.aws_subnet.subnet["subnet-07a84bddbd722791f"]: Read complete after 1s [id=subnet-07a84bddbd722791f]
data.aws_subnet.subnet["subnet-0e3bd9720bd4238db"]: Read complete after 1s [id=subnet-0e3bd9720bd4238db]
data.aws_subnet.subnet["subnet-00d780a2d518f5daf"]: Read complete after 1s [id=subnet-00d780a2d518f5daf]
data.aws_subnet.subnet["subnet-0d7a2d72cbad29100"]: Read complete after 1s [id=subnet-0d7a2d72cbad29100]
data.aws_subnet.subnet["subnet-0d81ffd4d8316977e"]: Read complete after 1s [id=subnet-0d81ffd4d8316977e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster_auth.cluster_auth will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "cluster_auth" {
      + id    = (known after apply)
      + name  = "MechTechApi"
      + token = (sensitive value)
    }

  # aws_cognito_user_pool_domain.mctech_cg_domain will be created
  + resource "aws_cognito_user_pool_domain" "mctech_cg_domain" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "mctech-cg-domain"
      + id                              = (known after apply)
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = "us-east-1_vkq68eel1"
      + version                         = (known after apply)
    }

  # aws_eks_access_entry.access-entry will be created
  + resource "aws_eks_access_entry" "access-entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "MechTechApi"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "fiap",
          + "live",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::066481472449:role/voclabs"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.eks-policy will be created
  + resource "aws_eks_access_policy_association" "eks-policy" {
      + associated_at = (known after apply)
      + cluster_name  = "MechTechApi"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::066481472449:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.eks-cluster will be created
  + resource "aws_eks_cluster" "eks-cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "MechTechApi"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::066481472449:role/LabRole"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = (known after apply)

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-00d780a2d518f5daf",
              + "subnet-06bc9c29259a1b8aa",
              + "subnet-07a84bddbd722791f",
              + "subnet-0d7a2d72cbad29100",
              + "subnet-0e3bd9720bd4238db",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node-group will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "MechTechApi"
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "t3a.medium",
        ]
      + node_group_name        = "NG-MechTechApi"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::066481472449:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-00d780a2d518f5daf",
          + "subnet-06bc9c29259a1b8aa",
          + "subnet-07a84bddbd722791f",
          + "subnet-0d7a2d72cbad29100",
          + "subnet-0e3bd9720bd4238db",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Este grupo e usado na live de terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SQLServer access"
              + from_port        = 1433
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 1433
            },
        ]
      + name                   = "SG-MechTechApi"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "name" = "SG-MechTechApi-tag"
        }
      + tags_all               = {
          + "name" = "SG-MechTechApi-tag"
        }
      + vpc_id                 = "vpc-09087a8211f98da81"
    }

  # kubernetes_secret.cognito_secrets will be created
  + resource "kubernetes_secret" "cognito_secrets" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "cognito-secrets"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @josemrl7, Action: `pull_request`*